Model: "functional_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 128)]        0                                            
__________________________________________________________________________________________________
embedding (Embedding)           (None, 128, 512)     9358848     input_1[0][0]                    
__________________________________________________________________________________________________
reshape (Reshape)               (None, 128, 512, 1)  0           embedding[0][0]                  
__________________________________________________________________________________________________
Conv2D_3 (Conv2D)               (None, 126, 1, 128)  196736      reshape[0][0]                    
__________________________________________________________________________________________________
Conv2D_4 (Conv2D)               (None, 125, 1, 128)  262272      reshape[0][0]                    
__________________________________________________________________________________________________
Conv2D_5 (Conv2D)               (None, 124, 1, 128)  327808      reshape[0][0]                    
__________________________________________________________________________________________________
MaxPool2D_3 (MaxPooling2D)      (None, 1, 1, 128)    0           Conv2D_3[0][0]                   
__________________________________________________________________________________________________
MaxPool2D_4 (MaxPooling2D)      (None, 1, 1, 128)    0           Conv2D_4[0][0]                   
__________________________________________________________________________________________________
MaxPool2D_5 (MaxPooling2D)      (None, 1, 1, 128)    0           Conv2D_5[0][0]                   
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 1, 1, 384)    0           MaxPool2D_3[0][0]                
                                                                 MaxPool2D_4[0][0]                
                                                                 MaxPool2D_5[0][0]                
__________________________________________________________________________________________________
flatten (Flatten)               (None, 384)          0           concatenate[0][0]                
__________________________________________________________________________________________________
dropout (Dropout)               (None, 384)          0           flatten[0][0]                    
__________________________________________________________________________________________________
dense (Dense)                   (None, 2)            770         dropout[0][0]                    
==================================================================================================
Total params: 10,146,434
Trainable params: 10,146,434
Non-trainable params: 0
__________________________________________________________________________________________________
